# LinearDimType Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..LinearDimType Property
ParameterTypeId Class See Also
---
"Dimension String Type"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId LinearDimType { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property LinearDimType As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ LinearDimType {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace